INSERT INTO public.readers (card_number, fio, address, phone)
VALUES ('R517221', 'Петров Игорь Иванович', 'Ленина 22', '+78889992312'),
       ('R517151', 'Иванова Ирина Юрьевна', 'Щорса 12', '+77779992312'),
       ('R512521', 'Легостаев Роман Петрович', 'Береговая 78', '+78887772312'),
       ('R517441', 'Орлов Антов Павлович', 'Республики 52', '+78889992777'),
       ('R517121', 'Юрьева Ольга Викторовна', 'Вишневая 7', '+78889955512');

INSERT INTO public.authors(name)
VALUES ('Лев Толстой'),
       ('Александ Пушкин'),
       ('Федор Михайлович Достоевский'),
       ('Джон Рональд Руэл Толкиен'),
       ('Рэй Брэдбери'),
       ('Бернар Вербер');

INSERT INTO public.books(author_id, name)
VALUES (1, 'Война и мир'),
       (2, 'Руслан и Людмила'),
       (3, 'Преступление и наказание'),
       (4, 'Хоббит, или туда и обратно'),
       (5, '451 градус по Фаренгейту'),
       (6, 'Муравьи');

INSERT INTO public.publishing_houses(name, city)
VALUES ('АСТ', 'Москва'),
       ('Питер', 'Санкт-Петербург'),
       ('Эксмо', 'Москва');

INSERT INTO public.published_books(book_id, ph_id, volume, price, count)
VALUES (1, 3, 996, 2000, 30),
       (2, 3, 288, 500, 40),
       (3, 2, 592, 350, 50),
       (4, 1, 544, 450, 15),
       (5, 3, 255, 440, 10),
       (6, 1, 420, 400, 7);

INSERT INTO public.books_exemplars(pb_id, book_code)
VALUES (1, 'B23-154345'),
       (1, 'B23-163345'),
       (1, 'B23-215345'),
       (2, 'B12-176545'),
       (2, 'B12-167655'),
       (2, 'B12-215765'),
       (3, 'B31-194745'),
       (3, 'B31-169475'),
       (3, 'B31-215947'),
       (4, 'B22-183445'),
       (4, 'B22-168345'),
       (4, 'B22-215834'),
       (5, 'B27-745345'),
       (5, 'B27-174545'),
       (5, 'B27-217455'),
       (6, 'B23-984345'),
       (6, 'B23-198445'),
       (6, 'B23-219845');


INSERT INTO public.issued_books(reader_id, book_id, issue_date)
VALUES (1, 1, '2020-10-10 11:30:30'),
       (1, 7, '2022-10-10 11:30:30'),
       (2, 12, '2023-10-10 11:30:30'),
       (2, 8, '2022-10-10 11:30:30'),
       (2, 5, '2019-10-10 11:30:30'),
       (3, 15, '2022-10-10 11:30:30'),
       (4, 2, '2021-10-10 11:30:30'),
       (5, 7, '2023-10-10 11:30:30'),
       (5, 3, '2020-10-10 11:30:30')
;