INSERT INTO Customers (firstname, lastname, email)
VALUES ('Иван', 'Васильев', 'ivan@mail.ru'),
       ('Сергей', 'Исаев', 'serg@ya.ru'),
       ('Илья', 'Востриков', 'vost@ya.ru'),
       ('Екатерина', 'Борисова', 'borisova@gmail.com'),
       ('Анна', 'Исаева', 'anna@gmail.com'),
       ('Сергей', 'Петров', 'serg@mail.ru'),
       ('Ирина', 'Мальцева', 'ira@mail.ru');

INSERT INTO Orders (customerid, orderdate, totalamount)
VALUES (1, '2023-09-07 00:00:00', 10000),
       (1, '2023-06-07 00:00:00', 7000),
       (2, '2023-05-07 00:00:00', 5000),
       (2, '2023-08-07 00:00:00', 3000),
       (2, '2023-07-07 00:00:00', 9000),
       (3, '2023-03-07 00:00:00', 3000),
       (4, '2023-08-07 00:00:00', 1000),
       (4, '2023-09-07 00:00:00', 16000),
       (5, '2023-09-07 00:00:00', 800),
       (6, '2023-06-07 00:00:00', 400),
       (7, '2023-08-07 00:00:00', 9000),
       (7, '2023-07-07 00:00:00', 7000);

INSERT INTO orderdetails (orderid, productid, quantity, unitprice)
VALUES (1, 224, 20, 500),
       (2, 123, 10, 300),
       (2, 532, 20, 200),
       (3, 342, 10, 250),
       (3, 346, 10, 150),
       (3, 341, 20, 50);